app/services/users/activation.rb

    def call
      downcase_email
      create_activation_token
      @user.save
---
UPDATE "users" SET "updated_at" = $1, "activation_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-02-15 12:27:36.167174"], ["activation_digest", "$2a$12$SNmX9ox72whWurQC8m7jJeQ4GwQzXcYumtfNN4FPUT0uiJYoTMjye"], ["id", 1]]