app/services/users/remember.rb

UPDATE "users" SET "updated_at" = $1, "remember_digest" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-02-15 12:30:17.799397"], ["remember_digest", "$2a$12$RfvwgB2yctS1taj9x4NPaOBG5zgPQjI/eR5vblkg2521p24WB1yHC"], ["id", 1]]
---
    def call
      if @user
        @user.remember_token = generate_new_token
        @user.remember_digest = user_digest(@user.remember_token)
        @user.save