app/views/users/show.html.erb

    <div class="col-md-8">
        <% if @user.posts.any? %>
            <h3> Posts (<%= @user.posts.count %>)</h3>
---
SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]