app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", @current_user %></span>
<span><%= pluralize(@current_user.posts.count, "micropost") %></span>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]