app/controllers/post_categories_controller.rb

SELECT "post_categories".* FROM "post_categories" WHERE "post_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."post_category_id" = $1 ORDER BY "posts"."created_at" DESC, created_at DESC LIMIT $2 OFFSET $3  [["post_category_id", 3], ["LIMIT", 30], ["OFFSET", 0]]
---
  def show
    @post_category = PostCategory.find(params[:id])
    @posts = @post_category.posts.order('created_at DESC').paginate(page: params[:page])