app/controllers/posts_controller.rb

SELECT "post_categories".* FROM "post_categories" ORDER BY "post_categories"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."post_category_id" = $1  [["post_category_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 3]]
---
  def index
    @post_categories = PostCategory.all
    @posts = Post.where(post_category_id: PostCategory.first.id)
                 .paginate(page: params[:page], per_page: 30)
    @random_posts = Post.limit(3)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 121], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "post_category_id", "title") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "2222"], ["user_id", 1], ["created_at", "2023-02-15 13:01:23.874538"], ["updated_at", "2023-02-15 13:01:23.874538"], ["post_category_id", 3], ["title", "1111"]]
---
  def create
    @post = @current_user.posts.build(post_params)
    @post.image.attach(params[:post][:image])
    if @post.save

SELECT "post_categories".* FROM "post_categories" LIMIT $1  [["LIMIT", 20]]
---
  def new
    @post = @current_user.posts.build if logged_in?
    @post_categories = PostCategory.limit(20).collect { |cat| [cat.title, cat.id] }