app/controllers/static_pages_controller.rb

  def home
    @posts = current_user ? current_user.posts.paginate(page: params[:page]) : Post.all.limit(5)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]